Revit 2027 API
BoundaryConditions.CreateAreaBoundaryConditions(Document, ElementId, IList<CurveLoop>, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) Method
 Creates a new custom area boundary conditions within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BoundaryConditions CreateAreaBoundaryConditions(
	Document doc,
	ElementId hostElemId,
	IList<CurveLoop> loops,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
Public Shared Function CreateAreaBoundaryConditions (
	doc As Document,
	hostElemId As ElementId,
	loops As IList(Of CurveLoop),
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double
) As BoundaryConditions
public:
static BoundaryConditions^ CreateAreaBoundaryConditions(
	Document^ doc,
	ElementId^ hostElemId,
	IList<CurveLoop^>^ loops,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
static member CreateAreaBoundaryConditions :
        doc : Document *
        hostElemId : ElementId *
        loops : IList<CurveLoop> *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float -> BoundaryConditions
Parameters
doc Document
 The document in which to create the boundary conditions.
hostElemId ElementId
 The AnalyticalElement host element for the area boundary conditions.
loops IList<CurveLoop>
 The loops that define geometry of the area boundary conditions. The curve loop collection should contain only closed loops.
X_Translation TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Return Value
BoundaryConditions
 If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 2 - "Area". Otherwise it returns null .
Exceptions
Exception | Condition
ArgumentException |  One of the following requirements is not satisfied : - curve loops loops are not planar - curve loops loops are self-intersecting - curve loops loops contains zero length curves -or- hostElemId is not a valid host for area boundary conditions. -or- Area boundary conditions already exist on the selected hostElemId.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
CreateAreaBoundaryConditions Overload
Autodesk.Revit.DB.Structure Namespace